Revit 2026 API

# Transform2DScale Property

---

The real number that represents the scale of the conformal transformation.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double Scale { get; }
```
```vb
Public ReadOnly Property Scale As Double
	Get
```
```cpp
public:
property double Scale {
	double get ();
}
```
```fsharp
member Scale : float with get
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This transformation is not conformal and the scale is undefined. |

When the transformation is conformal and can be decomposed as the product of a rigid-body motion, uniform scale and reflection, this property returns the scale value of the uniform scale transformation.

#### Reference

Transform2D Class

Autodesk.Revit.DB Namespace